#pragma once
#ifndef _EDGE_H
#define _EDGE_H

#define INF LLONG_MAX		//宏定义：无穷大
#include <iostream>
#include <sstream>
#include<string>

using namespace std;

/****************************************************************************************
*Author:chuansao825/bigbiginsulator
* Date:2021/11/28
* 类名：edge
* 功能：储存一条有向边的信息
*****************************************************************************************/
class edge {
public:
	int v;	//顶点v
	int w;		//顶点w
	double weight;	//边的权值

	/*****************************************************************************
	* @name   :  edge                                                               
	* @input   : v：顶点v	，w：顶点w，weight：权重                                                            
	* @output  : null                                                                
	* @brief   : 通过输入的信息构造一条无向边                                                                
	*****************************************************************************/						
	edge(int from,int to,double weight);		

	

	/*****************************************************************************
	* @name   :
	* @input   :
	* @output  :
	* @brief   :默认构造函数，将所有边的weight初始化为INF
	*****************************************************************************/
	edge();




	/*****************************************************************************
	* @name   :toString
	* @input   :
	* @output  :
	* @brief   :按照"v->w"的格式将数据打印出来
	*****************************************************************************/
	string toString();
};


#endif









